document.addEventListener("DOMContentLoaded", cloud)


const data = [
	{
		"x": 0.018387533724308014,
		"y": -0.0289494376629591,
		"z": -0.08646540343761444,
		"text": "history"
	},
	{
		"x": -0.00926706288009882,
		"y": -0.16865116357803345,
		"z": 0.08806093782186508,
		"text": "story"
	},
	{
		"x": 0.11197973787784576,
		"y": -0.10572241991758347,
		"z": -0.030532075092196465,
		"text": "история страны"
	},
	{
		"x": 0.022612368687987328,
		"y": -0.1251239776611328,
		"z": -0.006999924313277006,
		"text": "мировая история"
	},
	{
		"x": 0.04644719138741493,
		"y": 0.05058933049440384,
		"z": 0.029785212129354477,
		"text": "entire history"
	},
	{
		"x": -0.00573263643309474,
		"y": 0.007033843547105789,
		"z": 0.13885922729969025,
		"text": "новая история"
	},
	{
		"x": 0.030999066308140755,
		"y": -0.0702282264828682,
		"z": 0.038489606231451035,
		"text": "whole history"
	},
	{
		"x": -0.021197117865085602,
		"y": 0.024963004514575005,
		"z": -0.02610117569565773,
		"text": "современная история"
	},
	{
		"x": 0.009239844977855682,
		"y": 0.007558035664260387,
		"z": -0.06815744191408157,
		"text": "whole story"
	},
	{
		"x": 0.061639901250600815,
		"y": 0.062316834926605225,
		"z": 0.030671153217554092,
		"text": "собственная история"
	},
	{
		"x": 0.030362218618392944,
		"y": 0.04951561614871025,
		"z": 0.005014707334339619,
		"text": "world history"
	},
	{
		"x": 0.10303610563278198,
		"y": 0.047418013215065,
		"z": 0.14041177928447723,
		"text": "рассказ"
	},
	{
		"x": -0.07994137704372406,
		"y": -0.05597100779414177,
		"z": 0.05497279763221741,
		"text": "recent history"
	},
	{
		"x": -0.08010082691907883,
		"y": -0.013092315755784512,
		"z": -0.03302527964115143,
		"text": "история города"
	},
	{
		"x": 0.04719466343522072,
		"y": -0.013265585526823997,
		"z": -0.027994774281978607,
		"text": "history of country"
	},
	{
		"x": -0.045245759189128876,
		"y": -0.01731063611805439,
		"z": 0.14010459184646606,
		"text": "modern history"
	},
	{
		"x": 0.12408794462680817,
		"y": -0.02326725609600544,
		"z": 0.0891072079539299,
		"text": "country's history"
	},
	{
		"x": 0.012253954075276852,
		"y": -0.04532724618911743,
		"z": -0.00855198409408331,
		"text": "Tale"
	},
	{
		"x": -0.03237350285053253,
		"y": -0.03248737007379532,
		"z": 0.009469413198530674,
		"text": "история компании"
	},
	{
		"x": 0.022275825962424278,
		"y": 0.08474093675613403,
		"z": -0.014301812276244164,
		"text": "historical past"
	},
	{
		"x": -0.06932318210601807,
		"y": -0.06455191969871521,
		"z": -0.02266569994390011,
		"text": "рассказанный"
	},
	{
		"x": 0.05896928533911705,
		"y": -0.02083633281290531,
		"z": 0.01515851728618145,
		"text": "история народа"
	},
	{
		"x": 0.032364826649427414,
		"y": 0.061026833951473236,
		"z": 0.0876232385635376,
		"text": "year history"
	},
	{
		"x": 0.039091434329748154,
		"y": 0.01954650692641735,
		"z": -0.05353153124451637,
		"text": "история человечества"
	},
	{
		"x": -0.00651210593059659,
		"y": 0.027645187452435493,
		"z": 0.1184367835521698,
		"text": "история развития"
	},
	{
		"x": 0.008068463765084743,
		"y": 0.03783142939209938,
		"z": 0.020458703860640526,
		"text": "история России"
	},
	{
		"x": 0.1275404393672943,
		"y": -0.007272530812770128,
		"z": -0.018195096403360367,
		"text": "own history"
	},
	{
		"x": -0.06758546084165573,
		"y": 0.05787787586450577,
		"z": 0.07095054537057877,
		"text": "история государства"
	},
	{
		"x": 0.00817571859806776,
		"y": -0.06774980574846268,
		"z": 0.05092015862464905,
		"text": "first time in history"
	},
	{
		"x": -0.007481392938643694,
		"y": -0.07198930531740189,
		"z": 0.04908790439367294,
		"text": "история человека"
	},
	{
		"x": 0.028413016349077225,
		"y": 0.07253135740756989,
		"z": -0.022637158632278442,
		"text": "entire story"
	},
	{
		"x": -0.009613960981369019,
		"y": -0.09617169946432114,
		"z": -0.03687514364719391,
		"text": "известная история"
	},
	{
		"x": -0.040879201143980026,
		"y": 0.007375205866992474,
		"z": 0.03959742933511734,
		"text": "история мира"
	},
	{
		"x": -0.06985152512788773,
		"y": -0.03950278460979462,
		"z": -0.07330989837646484,
		"text": "own story"
	},
	{
		"x": -0.06815700232982635,
		"y": -0.00027688819682225585,
		"z": 0.04535643756389618,
		"text": "часть истории"
	},
	{
		"x": -0.03051678277552128,
		"y": 0.002472818596288562,
		"z": 0.08005174994468689,
		"text": "история истории"
	},
	{
		"x": -0.011434340849518776,
		"y": 0.0328548327088356,
		"z": -0.06163753196597099,
		"text": "недавняя история"
	},
	{
		"x": 0.022976640611886978,
		"y": 0.014237847179174423,
		"z": -0.06979317218065262,
		"text": "история создания"
	},
	{
		"x": -0.09120558202266693,
		"y": -0.02259569987654686,
		"z": -0.05944819748401642,
		"text": "recorded history"
	},
	{
		"x": 0.029349589720368385,
		"y": -0.030650915578007698,
		"z": 0.06054215878248215,
		"text": "many stories"
	},
	{
		"x": -0.057039450854063034,
		"y": -0.002387513406574726,
		"z": 0.013642826117575169,
		"text": "рассказывать"
	},
	{
		"x": -0.06548313796520233,
		"y": -0.010076644830405712,
		"z": 0.004654912743717432,
		"text": "history of world"
	},
	{
		"x": 0.052209772169589996,
		"y": -0.1238468661904335,
		"z": 0.053339261561632156,
		"text": "протяжение истории"
	},
	{
		"x": -0.019444558769464493,
		"y": 0.0940474271774292,
		"z": -0.0012163331266492605,
		"text": "история жизни"
	},
	{
		"x": 0.04446496069431305,
		"y": 0.010830308310687542,
		"z": -0.07745252549648285,
		"text": "история войны"
	},
	{
		"x": 0.020929425954818726,
		"y": -0.03320124000310898,
		"z": -0.028157932683825493,
		"text": "история возникновения"
	},
	{
		"x": -0.002099451143294573,
		"y": -0.04712260887026787,
		"z": -0.07116254419088364,
		"text": "история борьбы"
	},
	{
		"x": -0.04843335971236229,
		"y": -0.0035950555466115475,
		"z": -0.007332261186093092,
		"text": "предыстория"
	},
	{
		"x": -0.044520195573568344,
		"y": -0.05044456198811531,
		"z": 0.04563162848353386,
		"text": "печальная история"
	},
	{
		"x": 0.010778455063700676,
		"y": 0.17601855099201202,
		"z": -0.02638411521911621,
		"text": "удивительная история"
	},
	{
		"x": 0.10462329536676407,
		"y": -0.014924229122698307,
		"z": 0.12265225499868393,
		"text": "данная история"
	},
	{
		"x": 0.05571674928069115,
		"y": 0.08144240081310272,
		"z": 0.04789956286549568,
		"text": "рассказывающий"
	},
	{
		"x": -0.0685836672782898,
		"y": -0.019443290308117867,
		"z": -0.015936613082885742,
		"text": "история региона"
	},
	{
		"x": -0.03351867198944092,
		"y": 0.09385352581739426,
		"z": -0.006093605887144804,
		"text": "same story"
	},
	{
		"x": 0.04403412342071533,
		"y": -0.06990643590688705,
		"z": -0.05991245433688164,
		"text": "history of mankind"
	},
	{
		"x": -0.014372827485203743,
		"y": -0.06266006827354431,
		"z": 0.042241256684064865,
		"text": "начало истории"
	},
	{
		"x": -0.058772291988134384,
		"y": -0.02406703121960163,
		"z": -0.031420957297086716,
		"text": "невероятная история"
	},
	{
		"x": -0.006011598743498325,
		"y": -0.0350276418030262,
		"z": 0.11904410272836685,
		"text": "history of Russia"
	},
	{
		"x": -0.029379626736044884,
		"y": -0.020103879272937775,
		"z": -0.09200847893953323,
		"text": "интересная история"
	},
	{
		"x": -0.029009418562054634,
		"y": 0.03358849510550499,
		"z": 0.05031841620802879,
		"text": "повествовать"
	},
	{
		"x": -0.06832750886678696,
		"y": 0.08345986157655716,
		"z": 0.02576109580695629,
		"text": "изучение истории"
	},
	{
		"x": -0.04317871481180191,
		"y": -0.11837895959615707,
		"z": 0.005783138796687126,
		"text": "other stories"
	},
	{
		"x": 0.08748792856931686,
		"y": -0.0008230151725001633,
		"z": -0.0029350195545703173,
		"text": "большая история"
	},
	{
		"x": 0.1254601627588272,
		"y": 0.04429415985941887,
		"z": 0.10254480689764023,
		"text": "human history"
	},
	{
		"x": 0.0372997485101223,
		"y": 0.03150413930416107,
		"z": 0.07807710021734238,
		"text": "history of city"
	},
	{
		"x": 0.0026911222375929356,
		"y": 0.07205459475517273,
		"z": 0.0705098956823349,
		"text": "уникальная история"
	},
	{
		"x": -0.08882129937410355,
		"y": -0.009752805344760418,
		"z": 0.03488827124238014,
		"text": "city's history"
	},
	{
		"x": -0.025076450780034065,
		"y": -0.029568616300821304,
		"z": -0.06000955030322075,
		"text": "company's history"
	},
	{
		"x": -0.0015321571845561266,
		"y": 0.027013372629880905,
		"z": 0.07337957620620728,
		"text": "different story"
	},
	{
		"x": -0.003536958247423172,
		"y": -0.0010527863632887602,
		"z": 0.053206171840429306,
		"text": "bit of history"
	},
	{
		"x": 0.010681417770683765,
		"y": -0.03806145116686821,
		"z": -0.015330679714679718,
		"text": "история существования"
	},
	{
		"x": 0.011594833806157112,
		"y": -0.09572012722492218,
		"z": -0.004581225570291281,
		"text": "such stories"
	},
	{
		"x": -0.07489432394504547,
		"y": -0.02610069327056408,
		"z": 0.010909863747656345,
		"text": "история отношений"
	},
	{
		"x": 0.05563122779130936,
		"y": 0.0930086225271225,
		"z": 0.054193899035453796,
		"text": "history of persons"
	},
	{
		"x": 0.010487265884876251,
		"y": 0.07281316071748734,
		"z": -0.0011048783781006932,
		"text": "великая история"
	},
	{
		"x": 0.08621035516262054,
		"y": -0.013469462282955647,
		"z": 0.03185423091053963,
		"text": "part of history"
	},
	{
		"x": 0.03591371700167656,
		"y": -0.037936221808195114,
		"z": -0.0887567475438118,
		"text": "подобные истории"
	},
	{
		"x": 0.011333889327943325,
		"y": 0.11183954030275345,
		"z": 0.005565453786402941,
		"text": "древняя история"
	},
	{
		"x": -0.016662562265992165,
		"y": 0.059659410268068314,
		"z": 0.05107700824737549,
		"text": "history of nation"
	},
	{
		"x": 0.039638083428144455,
		"y": -0.07045254111289978,
		"z": 0.00877444352954626,
		"text": "человеческая история"
	},
	{
		"x": -0.06824755668640137,
		"y": -0.0703631266951561,
		"z": 0.01255815476179123,
		"text": "увлекательная история"
	},
	{
		"x": 0.10269952565431595,
		"y": 0.03743215277791023,
		"z": 0.05841168761253357,
		"text": "история проекта"
	},
	{
		"x": -0.028813863173127174,
		"y": -0.05170315504074097,
		"z": -0.022973665967583656,
		"text": "иcтopие"
	},
	{
		"x": -0.053641077131032944,
		"y": -0.058171309530735016,
		"z": -0.11681163311004639,
		"text": "ancient history"
	},
	{
		"x": 0.06112252548336983,
		"y": -0.06187126040458679,
		"z": -0.07086535543203354,
		"text": "российская история"
	},
	{
		"x": 0.03815038502216339,
		"y": -0.06810621172189713,
		"z": -0.058459267020225525,
		"text": "история культуры"
	},
	{
		"x": -0.10376974195241928,
		"y": 0.0696411058306694,
		"z": -0.011306039988994598,
		"text": "history of war"
	},
	{
		"x": 0.03556737303733826,
		"y": 0.031040044501423836,
		"z": -0.0014094271464273334,
		"text": "history of development"
	},
	{
		"x": 0.027905521914362907,
		"y": -0.0039009861648082733,
		"z": -0.033485375344753265,
		"text": "facts about history"
	},
	{
		"x": 0.09771442413330078,
		"y": -0.06364360451698303,
		"z": 0.02907680533826351,
		"text": "личная история"
	},
	{
		"x": 0.05699992552399635,
		"y": 0.05258262902498245,
		"z": -0.02888520061969757,
		"text": "history of region"
	},
	{
		"x": 0.04525855928659439,
		"y": -0.062457989901304245,
		"z": 0.06907547265291214,
		"text": "full story"
	},
	{
		"x": -0.013995908200740814,
		"y": -0.06361349672079086,
		"z": 0.07856575399637222,
		"text": "история годов"
	},
	{
		"x": 0.009549899026751518,
		"y": -0.10332668572664261,
		"z": -0.004754787776619196,
		"text": "история появления"
	},
	{
		"x": -0.04105829820036888,
		"y": 0.030022887513041496,
		"z": 0.011162839829921722,
		"text": "nation's history"
	},
	{
		"x": 0.0046537695452570915,
		"y": 0.10127633064985275,
		"z": -0.02900847978889942,
		"text": "история игр"
	},
	{
		"x": -0.017277203500270844,
		"y": -0.017342459410429,
		"z": -0.0020199352875351906,
		"text": "great story"
	},
	{
		"x": 0.13359104096889496,
		"y": 0.07101210206747055,
		"z": -0.02860555797815323,
		"text": "история группы"
	},
	{
		"x": -0.030406445264816284,
		"y": 0.001277546281926334,
		"z": -0.03347291424870491,
		"text": "история происхождения"
	}
]

function randInt(min, max) {
	return Math.floor(Math.random() * (max - min)) + min
}

function cloud() {
	/**
	 * @type HTMLDivElement
	 */
	const container = document.querySelector('.cloud')
	const halfWidth = container.offsetWidth / 2
	const halfHeight = container.offsetHeight / 2

	const radius = 120 / 450 * container.offsetWidth
	const dtr = Math.PI / 180
	const d = 300 / 450 * container.offsetWidth
	const tspeed = 3
	const size = 250 / 450 * container.offsetWidth

	/**
 * @type {Map<HTMLAnchorElement, {
 * cx: number | undefined,
 * cy: number | undefined,
 * cz: number | undefined,
 * alpha: number | undefined,
 * }>}
 */
	const items = new Map()

	data.forEach(item => {
		const a = document.createElement("a")

		const cx = item.x * container.offsetWidth * 2
		const cy = item.y * container.offsetWidth * 2
		const cz = item.z * container.offsetWidth * 2

		a.innerText = item.text

		items.set(a, {
			cz,
			cx,
			cy,
		})

		a.style.setProperty("--cx", cx)
		a.style.setProperty("--cy", cy)

		container.append(a)
	})

	let mouseX = 0
	let mouseY = 0
	let isActive = false
	let lastVDelta = 1
	let lastHDelta = 1

	container.style.setProperty("--container-half-width", `${halfWidth}px`)
	container.style.setProperty("--container-half-height", `${halfHeight}px`)

	container.addEventListener("mouseover", () => {
		isActive = true
	})

	container.addEventListener("mouseout", () => {
		isActive = false
	})

	container.addEventListener("mousemove", event => {
		mouseX = (event.clientX - (container.offsetLeft + halfWidth)) / 5
		mouseY = (event.clientY - (container.offsetTop + halfHeight)) / 5
	})

	update()

	function update() {
		let vDelta
		let hDelta

		if (isActive) {
			vDelta = (Math.min(Math.max(-mouseY, -size), size) / radius) * tspeed
			hDelta = (-Math.min(Math.max(-mouseX, -size), size) / radius) * tspeed
		} else {
			vDelta = lastVDelta * 0.98
			hDelta = lastHDelta * 0.98
		}

		if (Math.abs(vDelta) <= 0.01 && Math.abs(hDelta) <= 0.01) {
			requestAnimationFrame(update)
			return
		}

		lastVDelta = vDelta
		lastHDelta = hDelta

		const { ca, cb, cc, sa, sb, sc } = sineCosine(vDelta, hDelta, 0)

		items.entries().toArray().sort((vItem1, vItem2) => {
			if (vItem1[1].cz > vItem2[1].cz) {
				return -1
			} else if (vItem1[1].cz < vItem2[1].cz) {
				return 1
			} else {
				return 0
			}
		}).forEach(([link, size], index) => {
			const rx1 = size.cx
			const ry1 = size.cy * ca + size.cz * (-sa)
			const rz1 = size.cy * sa + size.cz * ca

			const rx2 = rx1 * cb + rz1 * sb
			const ry2 = ry1
			const rz2 = rx1 * (-sb) + rz1 * cb

			const rx3 = rx2 * cc + ry2 * (-sc)
			const ry3 = rx2 * sc + ry2 * cc
			const rz3 = rz2

			const per = d / (d + rz3)

			size.cx = rx3
			size.cy = ry3
			size.cz = rz3

			link.style.setProperty("--z-index", index)
			link.style.setProperty("--cx", rx3)
			link.style.setProperty("--cy", ry3)
			link.style.setProperty("--opacity", Math.max(0.5, Math.min((per - 0.6) * (10 / 6), 1)))
		})

		requestAnimationFrame(update)
	}

	function sineCosine(a, b, c) {
		return {
			sa: Math.sin(a * dtr),
			ca: Math.cos(a * dtr),
			sb: Math.sin(b * dtr),
			cb: Math.cos(b * dtr),
			sc: Math.sin(c * dtr),
			cc: Math.cos(c * dtr)
		}
	}
}